"The Unarchiver/Unarchive To Current Folder" = "Разархиваторът/Разархивирай в папката";

"The Unarchiver/Unarchive To Desktop" = "Разархиваторът/Разархивирай в Десктоп";

"The Unarchiver/Unarchive To..." = "Разархиваторът/Разархивирай в…";